#Написать калькулятор для вычисления дискриминанта. На вход подаются коэффициенты квадратного уравнения, выход - значение дискриминанта.
a = int(input())
b = int(input())
c = int(input())
print(b**2 - 4*a*c)