#Дан список, упорядоченный по неубыванию элементов в нем. Определите, сколько в нем различных элементов.
a = set(input().split())
print(len(a))